# frozen_string_literal: true

tap 'buo/cask-upgrade'
tap 'flschweiger/flutter'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'mongodb/brew'
tap 'Schniz/tap'
tap 'versent/homebrew-taps'
tap 'weaveworks/tap'

cask 'alfred'
# cask 'amazon-music'
cask 'android-sdk'
# cask 'android-studio'
cask 'basictex'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'flutter'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iterm2'
cask 'java11'
# cask 'microsoft-office'
cask 'mongodb-compass'
cask 'mysqlworkbench'
cask 'ngrok'
cask 'obsidian'
cask 'openvpn-connect'
cask 'postman'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
# cask 'steam'
# cask 'telegram'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'zoom'

brew 'asdf'
brew 'awscli'
brew 'bower'
brew 'brew-cask-completion'
brew 'buildkit'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'devspace'
brew 'diff-so-fancy'
brew 'eksctl'
brew 'elasticsearch', restart_service: true
brew 'fnm'
brew 'fswatch'
brew 'gawk'
brew 'gcc'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'go'
brew 'gnupg'
brew 'git-secret'
brew 'imagemagick@6'
brew 'jq'
brew 'kubectx'
brew 'mas'
brew 'memcached', restart_service: true
brew 'mongodb-community'
brew 'mysql', restart_service: true
brew 'nginx'
brew 'openjdk@11'
brew 'openssl@3'
brew 'perl'
brew 'postgresql@14', restart_service: true
brew 'python@3.8'
brew 'python@3.9'
brew 'python@3.10'
brew 'rbenv'
brew 'redis'
brew 'saml2aws'
brew 'tmux'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'yq'
brew 'yt-dlp'

mas 'Amphetamine', id: 937984704
mas 'Keynote', id: 409183694
mas 'Xcode', id: 497799835
