tap 'flschweiger/flutter'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'buo/cask-upgrade'
tap 'Schniz/tap'
tap 'mongodb/brew'

cask 'adoptopenjdk8'
cask 'alfred'
cask 'amazon-music'
cask 'android-sdk'
cask 'android-studio'
cask 'discord'
cask 'docker'
cask 'flutter'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'java11'
cask 'microsoft-office'
cask 'mongodb-compass'
cask 'mysqlworkbench'
cask 'ngrok'
cask 'postman'
cask 'slack'
cask 'sourcetree'
# cask 'spotify'
cask 'steam'
cask 'telegram'
cask 'tunnelblick'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'zoomus'

brew 'bower'
brew 'brew-cask-completion'
brew 'coreutils'
brew 'elasticsearch'
brew 'fnm'
brew 'gcc'
brew 'git'
brew 'diff-so-fancy'
brew 'go'
brew 'gpg'
brew 'imagemagick@6'
brew 'jq'
brew 'mas'
brew 'memcached'
brew 'mongodb-community'
brew 'mysql'
brew 'nginx'
brew 'openssl'
brew 'postgresql'
brew 'python'
brew 'rbenv'
brew 'redis'
brew 'tmux'
brew 'wget'
brew 'yarn'

mas 'Amphetamine', id: 937984704
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'Xcode', id: 497799835
